data = [
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '박병훈', '야간': '권헌일', '휴무': '이영재'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '이영재', '야간': '권헌일', '휴무': '박병훈'},
    {'주간': '박병훈', '야간': '이영재', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '박병훈', '휴무': '이영재'},
    {'주간': '이영재', '야간': '권헌일', '휴무': '박병훈'},
    {'주간': '이영재', '야간': '박병훈', '휴무': '권헌일'},
    {'주간': '권헌일', '야간': '이영재', '휴무': '박병훈'}
]


# 각 이름별로 갯수를 저장할 딕셔너리 초기화
count_by_name = {'이영재': {'주간': 0, '야간': 0, '휴무': 0}, '박병훈': {'주간': 0, '야간': 0, '휴무': 0}, '권헌일': {'주간': 0, '야간': 0, '휴무': 0}}

# 데이터를 순회하며 각 이름의 갯수를 카운트
for item in data:
    count_by_name[item['휴무']]['휴무'] += 1
    count_by_name[item['주간']]['주간'] += 1
    count_by_name[item['야간']]['야간'] += 1

# 결과 출력
print(count_by_name)
