
a = {'주간': '이성용', '주간': '이재평', '야간': '안경국', '휴무': '엑스맨'}
b = {'주간': '이재평', '주간': '안경국', '야간': '이성용', '휴무': '엑스맨'}
c = {'주간': '안경국', '주간': '이성용', '야간': '이재평', '휴무': '엑스맨'}
d = {'주간': '이성용', '야간': '이재평', '휴무': '안경국'}
e = {'주간': '안경국', '야간': '이성용', '휴무': '이재평'}
f = {'주간': '이재평', '야간': '안경국', '휴무': '이성용'}
g = {'주간': '     ', '야간': '이재평', '휴무': '이성용,안경국'}
h = {'주간': '     ', '야간': '이성용', '휴무': '안경국,이재평'}
i = {'주간': '     ', '야간': '안경국', '휴무': '이재평,이성용'}
j = {'주간': '이성용', '야간': '안경국', '휴무': '이재평'}
k = {'주간': '이재평', '야간': '이성용', '휴무': '안경국'}
l = {'주간': '안경국', '야간': '이재평', '휴무': '이성용'}


data = [a, b, c, d, e, f, g, h, i,j,k,l]

# a ->x c, b ->x a, c ->x b,    
# a ->x h, b ->x g, c ->x i   
# d ->x b, e ->x a, f ->x c  
# d ->x i, e ->x g, f ->x h
# g ->x i, g ->x b
# h->x g, h->x a
# i ->x h, i ->x c


  
for _ in range(4):
  
  print(data[data.index(d)])
  print(data[data.index(d)]) 
  print(data[data.index(i)])   
  print(data[data.index(f)])
  print(data[data.index(k)])
  print(data[data.index(e)]) 
  print(data[data.index(l)]) 
  
 
  
